nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/Media.c
/********************************************************************
//版权说明	:Shenzhen E-EYE Co. Ltd., Copyright 2009- All Rights Reserved.
//文件名称	:Media.c		
//功能		:实现图像和录音的存储
//版本号	: 
//开发人	:dxl
//开发时间	:2012.9
//修改者	:
//修改时间	:
//修改简要说明	:
//备注		:
***********************************************************************/
//***************包含文件*****************
#include "stm32f10x.h"
#include "stm32f10x_rtc.h"
#include "stm32f10x_iwdg.h"
#include "ffconf.h"
#include "ff.h"
#include "Media.h"
#include "Rtc.h"
#include "usbh_usr.h"
#include "mmc_sd.h"
#include "taskschedule.h"
#include "SysTick.h"
#include "EepromPram.h"
#include <string.h>

//****************宏定义****************

//***************本地变量******************
u8	CurrentWavFolder = 0;//当前录音文件夹
u8	CurrentJpgFolder = 0;//当前图像文件夹
static u16	CurrentWavFile = 0;//当前录音文件夹下的当前文件
static u16	CurrentJpgFile = 0;//当前图像文件夹下的当前文件
static u8	MediaDelEnableFlag = 0;//多媒体强制删除使能标志
static u8	EnableFlag = 1;//进入删除流程的使能标志
u8	SdOnOffFlag = 0;//SD卡在线标志；1在线，0不在线,当sd卡初始化失败时该标志也会清0
u32	JpgCreatTime;//jpg文件创建的时间
u32	WavCreatTime;//wav文件创建的时间
u8      MediaType = 0;//多媒体类型，0图像，1音频，2视频
u8      MediaFormat = 0;//多媒体格式编码,0JPEG,1TIF,2MP3,3WAV,4WMV
u8	MediaRatio = 1;//多媒体分辨率
u8      MediaChannelID = 0;//多媒体通道ID
u8      MediaEvenCode = 0;//多媒体事件编码
u16     MediaCommand = 0;//多媒体命令  0:停止  N:张数  0XFFFF:录象 0XFFFE:一直拍照  BY WYF
u16     MediaPhotoSpace = 0; //拍照间隔时间 BY WYF
u8	MemoryUploadFileName[_MAX_LFN];//存储多媒体数据上传的完整文件名
u8      MultiMediaSendFlag = 0;//多媒体发送标志，0为不在发送，1为在发送
u16	MemoryUploadSendCount = 0;//发送次数计数
//****************全局变量*****************

//****************外部变量*****************
//extern RecordDef RECORD_DEF;            //该结构体包含了录音多媒体ID
extern u8      MultiMediaIndexSendFlag;//多媒体检索上传标志,1为需要检索上传,0为不需要
u8      RecordSendFlag;//dxl,2015.8 去掉extern //录音文件上传标志,1为上传
extern u32     PhotoID;//图像多媒体ID
/*********************************************************************
//函数名称	:Media_GetSdOnLineFlag
//功能		:获得SD卡在线标志
//输入		:
//输出		:
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:返回1在线；返回0不在线
*********************************************************************/
u8 Media_GetSdOnLineFlag(void)
{
	return SdOnOffFlag;
}
/*********************************************************************
//函数名称	:Media_FindCurFolder
//功能		:查找JPG或WAV的当前位置（当前文件夹，当前文件）
//输入		:
//输出		:
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:
//备注		:Type只能为MEDIA_TYPE_JPG、MEDIA_TYPE_WAV
//		:文件夹下面都会有一个文件日志文件log.bin
*********************************************************************/
void Media_FindCurFolder(u8 *Folder, u16 *File, u8 Type)
{
	u8	Dir[15];
	u8	FileName[_MAX_LFN];
	u8	i;
	u8	flag;
	u8	length;
	FIL     file;
	DIR	dir;
	u8	CurFolder;
	u16	CurFile;
	u32	NewestTime;
	u32	Time;
	u8	Buffer[5];
	u32	Byte;
	//FRESULT res;
	
	if(0 == SdOnOffFlag)
	{
		return ;
	}

	if(MEDIA_TYPE_JPG == Type)
	{
		strcpy((char *)Dir,"1:/JPG");
	}
	else if(MEDIA_TYPE_WAV == Type)
	{
		strcpy((char *)Dir,"1:/WAV");
	}
	else
	{
		return ;
	}
	CurFolder = 0;
	CurFile = 0;
	flag = 0;
	NewestTime = 0;
	//查找有无已创建的目录
	for(i=1; i<=FOLDER_NUM_MAX; i++)//文件夹JPG1~JPG32
	{
        IWDG_ReloadCounter();//喂狗
		if(i < 10)
		{
			Dir[6] = i+0x30;
			Dir[7] = 0;
		}
		else
		{
			Dir[6] = i/10+0x30;
			Dir[7] = i%10+0x30;
			Dir[8] = 0;
		}
		if(FR_OK == f_opendir(&dir, ff_NameConver(Dir)))
		{
			strcpy((char *)FileName,(char const *)Dir);
			length = strlen((char const *)FileName);
			memcpy(FileName+length,"/log.bin",8);
			length += 8;
			FileName[length] = 0;
			if(f_open(&file,ff_NameConver(FileName),FA_READ|FA_WRITE) == FR_OK)
			{
				flag = 1;
				//if(0 == file.fsize%9)
                if((0 == file.fsize%9)&&(file.fsize >= 9))//dxl,2014.9.9修改为这个
				{
					if((file.fsize/9) < FOLDER_FILE_NUM_MAX)
					{
						f_close(&file);
						strcpy((char *)FileName,(char const *)Dir);
						length = strlen((char const *)FileName);
						strcpy((char *)FileName+length,"/delete.bin");
						if(f_open(&file,ff_NameConver(FileName),FA_READ|FA_WRITE) == FR_OK)
						{
						
						}
						else
						{
							//if(0 == file.fsize)
							//{
								f_close(&file);
								CurFolder = i;
								CurFile = file.fsize/9;
								break;
							//}
								/*
							res = f_lseek(&file,file.fsize-9);
							if(FR_OK == res)
							{
								if(FR_OK == f_read (&file, Buffer, 4, &Byte))
								{
									Time = 0;
									Time |= Buffer[0] << 24;
									Time |= Buffer[1] << 16;
									Time |= Buffer[2] << 8;
									Time |= Buffer[3];
									if(Time > NewestTime)
									{
										NewestTime = Time;
										CurFolder = i;
										CurFile = file.fsize/9;
									}	
								}
							}
								*/
							
							
						}
					}
					else
					{
						f_close(&file);
					}
				}
				else//log.bin文件出错
				{
                                        if(file.fsize > 0)//dxl,2015.5.26增加
                                        {
					        f_close(&file);
					        strcpy((char *)FileName,(char const *)Dir);
					        length = strlen((char const *)FileName);
					        strcpy((char *)FileName+length,"/delete.bin");
					        if(FR_OK == f_open(&file,ff_NameConver(FileName),FA_OPEN_ALWAYS|FA_READ|FA_WRITE))
					        {
				
					        }
                                        }
					f_close(&file);
					
				}
			}
			else//log.bin不存在或打开出错
			{	
				strcpy((char *)FileName,(char const *)Dir);
				length = strlen((char const *)FileName);
				strcpy((char *)FileName+length,"/delete.bin");
				if(FR_OK == f_open(&file,ff_NameConver(FileName),FA_OPEN_ALWAYS|FA_READ|FA_WRITE))
				{
				
				}
				f_close(&file);
				
			}
			f_close(&file);
		}
		
	}
	if(0 == CurFolder)
	{
		if(0 == flag)//空卡时没有任何文件夹，创建JPG1
		{
			Dir[6] = '1';
			Dir[7] = 0;
			//创建新的目录
			f_mkdir(ff_NameConver(Dir));
			//创建日志文件
			strcpy((char *)FileName,(char const *)Dir);
			length = strlen((char const *)FileName);
			memcpy(FileName+length,"/log.bin",8);
			length += 8;
			FileName[length] = 0;
			//创建文件
			if(FR_OK == f_open(&file,ff_NameConver(FileName),FA_OPEN_ALWAYS|FA_READ|FA_WRITE))
            {
          
