nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/Media.c
            }
            else
            {
                    //显示TF卡接口自检成功,dxl,2014.1.6,V1.01.06以后才具有该功能
//dxl,2015.8                    LcdClearScreen(); 
//dxl,2015.8                    LcdShowCaptionEx((char *)"TF卡自检失败",2); 
            }
			f_close(&file);
			CurFolder = 1;
			CurFile = 0;
		}
		else
		{
                        
			NewestTime = 0;
			//最新的时间为当前文件夹
			for(i=1; i<=FOLDER_NUM_MAX; i++)
			{
                IWDG_ReloadCounter();//喂狗
				if(i < 10)
				{
					Dir[6] = i+0x30;
					Dir[7] = 0;
				}
				else
				{
					Dir[6] = i/10+0x30;
					Dir[7] = i%10+0x30;
					Dir[8] = 0;
				}
				strcpy((char *)FileName,(char const *)Dir);
				length = strlen((char const *)FileName);
				memcpy(FileName+length,"/log.bin",8);
				FileName[length+8] = 0;
				if(FR_OK == f_open(&file,ff_NameConver(FileName),FA_READ|FA_WRITE))
				{
					if((0 == file.fsize%9)&&(file.fsize >=9))//至少要存储一半以上的文件
					{
						f_lseek(&file,file.fsize-9);
						if(FR_OK == f_read (&file, Buffer, 4, &Byte))
						{
							Time = 0;
							Time |= Buffer[0] << 24;
							Time |= Buffer[1] << 16;
							Time |= Buffer[2] << 8;
							Time |= Buffer[3];
							if(Time > NewestTime)
							{
								NewestTime = Time;
								CurFolder = i;
								CurFile = file.fsize/9;
							}
						}
					}
				}
				f_close(&file);
			}
			if(0 == NewestTime)//没有找到,默认为WAV1
			{
				Dir[6] = '1';
				Dir[7] = 0;
				//创建新的目录
				f_mkdir(ff_NameConver(Dir));
				//创建日志文件
				strcpy((char *)FileName,(char const *)Dir);
				length = strlen((char const *)FileName);
				memcpy(FileName+length,"/log.bin",8);
				length += 8;
				FileName[length] = 0;
				//创建文件
				if(FR_OK == f_open(&file,ff_NameConver(FileName),FA_OPEN_ALWAYS|FA_READ|FA_WRITE))
                {
                                
                }
                else
                {
                        //显示TF卡接口自检成功,dxl,2014.1.6,V1.01.06以后才具有该功能
//dxl,2015.8                        LcdClearScreen(); 
//dxl,2015.8                        LcdShowCaptionEx((char *)"TF卡自检失败",2); 
                }
				CurFolder = 1;
				CurFile = file.fsize/9;
				f_close(&file);
			}
		}
	}
        else
        {
          
        }
	*Folder = CurFolder;
	*File = CurFile;
}
/*********************************************************************
//函数名称	:Media_CheckSdOnOff
//功能		:检测SD卡在与不在
//输入		:
//输出		:
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:
//备注		:在:SdOnOffFlag = 1;不在SdOnOffFlag = 0,dxl,2014.6.18
//		:
*********************************************************************/
void Media_CheckSdOnOff(void)
{
    u8	Status;
	
	Status  = GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_13);
	if(0 == Status)
	{
		SdOnOffFlag = 1;
	}
	else
	{
		SdOnOffFlag = 0;
	}
}

/*********************************************************************
//函数名称	:Media_FolderCheck(void)
//功能		:文件夹自检
//输入		:
//输出		:
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:
//备注		:确定当前使用的录音文件夹和拍照文件夹
//		:文件夹下面都会有一个文件日志文件log.bin
*********************************************************************/
void Media_FolderCheck(void)
{
	

	if(1 == SdOnOffFlag)
	{
		//定位当前图像文件夹
		Media_FindCurFolder(&CurrentJpgFolder, &CurrentJpgFile, MEDIA_TYPE_JPG);
		//定位当前录音文件夹
		Media_FindCurFolder(&CurrentWavFolder, &CurrentWavFile, MEDIA_TYPE_WAV);
		//标记需要删除的文件
		Media_SignDelFlag(MEDIA_TYPE_JPG);
		//标记需要删除的文件
		Media_SignDelFlag(MEDIA_TYPE_WAV);
		
	}
}
/*********************************************************************
//函数名称	:Media_EnableDeleteFlag(void)
//功能		:使能删除标志
//输入		:
//输出		:
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:
//备注		:当容量非常小时会强制删除文件
*********************************************************************/
void Media_EnableDeleteFlag(void)
{

	if(0 == SdOnOffFlag)
	{
		return;
	}
	EnableFlag = 1;
	MediaDelEnableFlag = 1;
}
/*********************************************************************
//函数名称	:Media_GetSignNum
//功能		:获取已标记文件夹数量
//输入		:
//输出		:
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:
//备注		:Type只能为MEDIA_TYPE_JPG、MEDIA_TYPE_WAV
*********************************************************************/
u8 Media_GetSignNum(u8 Type)
{
	u8	i;
	u8	length;
	u8	FileName[_MAX_LFN];
	FIL	file;
	u8	count;
	
	if(0 == SdOnOffFlag)
	{
		return 0;
	}

	if(MEDIA_TYPE_JPG == Type)
	{
		strcpy((char *)FileName,"1:/JPG");
	}
	else if(MEDIA_TYPE_WAV == Type)
	{
		strcpy((char *)FileName,"1:/WAV");
	}
	length = strlen((char *)FileName);
	count = 0;
	for(i=1; i<= FOLDER_NUM_MAX; i++)
	{
        IWDG_ReloadCounter();//喂狗
		if(i<10)
		{
			FileName[length++] = i+0x30;
			strcpy((char *)FileName+length,"/delete.bin");
			if(FR_OK == f_open(&file,ff_NameConver(FileName),FA_READ|FA_WRITE))
			{
				count++;
				f_close(&file);
			}
			else
			{
				f_close(&file);
				length = 6;
				FileName[length++] = i+0x30;
				strcpy((char *)FileName+length,"/DELETE.BIN");
				if(FR_OK == f_open(&file,ff_NameConver(FileName),FA_READ|FA_WRITE))
				{
					count++;
				}
				f_close(&file);
			}
		}
		else 
		{
			FileName[length++] = i/10+0x30;
			FileName[length++] = i%10+0x30;
			strcpy((char *)FileName+length,"/delete.bin");
			if(FR_OK == f_open(&file,ff_NameConver(FileName),FA_READ|FA_WRITE))
			{
				count++;
				f_close(&file);
			}
			else
			{
				f_close(&file);
				length = 6;
				FileName[length++] = i/10+0x30;
				FileName[length++] = i%10+0x30;
				strcpy((char *)FileName+length,"/DELETE.BIN");
				if(FR_OK == f_open(&file,ff_NameConver(FileName),FA_READ|FA_WRITE))
				{
					count++;
				}
				f_close(&file);
			}
		}
		
	}
	return count;
	
}
/*********************************************************************
//函数名称	:Media_GetFileName
//功能		:获取文件名
//输入		:
//输出		:
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:
//备注		:Type只能为MEDIA_TYPE_JPG、MEDIA_TYPE_WAV
//		:录音文件名：月+日+时+分，遵循8.3文件名格式
//		:图像文件名：日+时+分+秒，遵循8.3文件名格式
*********************************************************************/
void Media_GetFileName(u8 *pBuffer, u8 Type)
{
	TIME_T tt;
	u8	*p;
	u8	length;

	if(0 == SdOnOffFlag)
	{
		return ;
	}
	if(MEDIA_TYPE_JPG == Type)
	{
		RTC_ReadTime(&tt);
		JpgCreatTime = RTC_GetCounter();
		p=pBuffer;
		strcpy((char *)p,"1:/JPG");
		length = strlen((char const *)p);
		p += length;
		if(CurrentJpgFolder < 10)
		{
			*p++ = CurrentJpgFolder+0x30;
			*p++ = '/';
		} 
		else
		{
			*p++ = CurrentJpgFolder/10+0x30;
			*p++ = CurrentJpgFolder%10+0x30;
			*p++ = '/';
		}
		*p++ = tt.day/10+0x30;
		*p++ = tt.day%10+0x30;
		*p++ = tt.hour/10+0x30;
		*p++ = tt.hour%10+0x30;
		*p++ = tt.min/10+0x30;
		*p++ = tt.min%10+0x30;
		*p++ = tt.sec/10+0x30;
		*p++ = tt.sec%10+0x30;
		*p++ = '.';
		*p++ = 'j';
		*p++ = 'p';
		*p++ = 'g';
		*p++ = 0;//结尾字符
	}
	else if(MEDIA_TYPE_WAV == Type)
	{
		RTC_ReadTime(&tt);
		WavCreatTime = RTC_GetCounter();
		p=pBuffer;
		strcpy((char *)p,"1:/WAV");
		length = strlen((char const *)p);
		p += length;
		if(CurrentWavFolder < 10)
		{
			*p++ = CurrentWavFolder+0x30;
			*p++ = '/';
		} 
		else
		{
			*p++ = CurrentWavFolder/10+0x30;
			*p++ = CurrentWavFolder%10+0x30;
			*p++ = '/';
		}
		*p++ = tt.month/10+0x30;
		*p++ = tt.month%10+0x30;
		*p++ = tt.day/10+0x30;
		*p++ = tt.day%10+0x30;
		*p++ = tt.hour/10+0x30;
		*p++ = tt.hour%10+0x30;
		*p++ = tt.min/10+0x30;
		*p++ = tt.min%10+0x30;
		*p++ = '.';
		*p++ = 'w';
		*p++ = 'a';
		*p++ = 'v';
		*p++ = 0;//结尾字符
	}
}
/*********************************************************************
//函数名称	:Media_SaveLog(void)
//功能		:保存log.bin文件
//输入		:
//输出		:
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:Type只能为MEDIA_TYPE_JPG、MEDIA_TYPE_WAV
//备注		:在保存完一副图像或一段录音后需要调用该函数，把相关信息保存至检索文件log.bin中
*********************************************************************/
void Media_SaveLog(u32 MediaID, u8 Type)
{
	FIL file;
	u8	Dir[15];
	u8	FileName[_MAX_LFN];
	u8	CurrentFolder;
	u16	CurrentFile;
	u8	i;
	u8	sum;
	u8	length;
	u8	Buffer[12];
	u32	temp;
	u32	Bw;
	u32	CreatTime;
	FRESULT  res;
	
	if(0 == SdOnOffFlag)
	{
		return ;
	}

