nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/Media.c
	if(MEDIA_TYPE_JPG == Type)
	{
		CurrentJpgFile++;
		CurrentFolder = CurrentJpgFolder;
		if(0 == CurrentFolder)
		{
			return ;
		}
		strcpy((char *)Dir,"1:/JPG");
		CreatTime = JpgCreatTime;
		CurrentFile = CurrentJpgFile;
	}
	else if(MEDIA_TYPE_WAV == Type)
	{
		CurrentWavFile++;
		CurrentFolder = CurrentWavFolder;
		if(0 == CurrentFolder)
		{
			return ;
		}
		strcpy((char *)Dir,"1:/WAV");
		CreatTime = WavCreatTime;
		CurrentFile = CurrentWavFile;
	}
	else
	{
		return ;
	}
	if(CurrentFolder < 10)
	{
		Dir[6] = CurrentFolder+0x30;
		Dir[7] = 0;
	}
	else
	{
		Dir[6] = CurrentFolder/10+0x30;
		Dir[7] = CurrentFolder%10+0x30;
		Dir[8] = 0;
	}
	//写日志文档log.bin
	strcpy((char *)FileName,(char const *)Dir);
	length = strlen((char const *)FileName);
	memcpy(FileName+length,"/log.bin",8);
	FileName[length+8] = 0;
	if(FR_OK == f_open(&file,ff_NameConver(FileName),FA_OPEN_ALWAYS|FA_READ|FA_WRITE))
	{
		f_lseek(&file,file.fsize);
		//写入该文件创建的时间
		temp = CreatTime;
		Buffer[0] = temp >> 24;
		Buffer[1] = temp >> 16;
		Buffer[2] = temp >> 8;
		Buffer[3] = temp;
		//写入多媒体ID
		temp = MediaID;
		Buffer[4] = temp >> 24;
		Buffer[5] = temp >> 16;
		Buffer[6] = temp >> 8;
		Buffer[7] = temp;
		sum = 0;
		for(i=0; i<8; i++)
		{
			sum += Buffer[i];
		}
		Buffer[8] = sum;
		res = f_write(&file,Buffer,9,&Bw);
		f_close(&file);
	}
	if(CurrentFile >= FOLDER_FILE_NUM_MAX)//表明已满当前文件夹已满
	{
		CurrentFile = 0;
		//查找下一个文件夹存在否
		CurrentFolder++;
		if(CurrentFolder > FOLDER_NUM_MAX)
		{
			CurrentFolder = 1;
		}
		if(MEDIA_TYPE_JPG == Type)
		{
			CurrentJpgFolder = CurrentFolder;
			CurrentJpgFile = 0;
		}
		else if(MEDIA_TYPE_WAV == Type)
		{
			CurrentWavFolder = CurrentFolder;
			CurrentWavFile = 0;
		}
		if(CurrentFolder < 10)
		{
			Dir[6] = CurrentFolder+0x30;
			Dir[7] = 0;
		}
		else
		{
			Dir[6] = CurrentFolder/10+0x30;
			Dir[7] = CurrentFolder%10+0x30;
			Dir[8] = 0;
		}
		//创建新的文件夹
		res = f_mkdir(ff_NameConver(Dir));
		//创建日志文档
		strcpy((char *)FileName,(char const *)Dir);
		length = strlen((char const *)FileName);
		memcpy(FileName+length,"/log.bin",8);
		FileName[length+8] = 0;
		res = f_open(&file,ff_NameConver(FileName),FA_OPEN_ALWAYS|FA_READ|FA_WRITE);
		f_close(&file);
		//标记需要删除的文件
		Media_SignDelFlag(Type);
	}
	if(FR_OK == res)
	{
	
	}
}
/*********************************************************************
//函数名称	:Media_SignDelFlag(void)
//功能		:标记删除标志
//输入		:
//输出		:
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:
//备注		:在一个文件夹创建一个delete.bin文件，用于标识该文件夹需要删除,调用一次只能标记一个文件夹
*********************************************************************/
void Media_SignDelFlag(u8 Type)
{
	u32	ReservedByte;
	DIR dir;
	FIL file;
	u8	Dir[15];
	u8	Folder;
	u8	FileName[_MAX_LFN];
	u8	i;
	u8	j;
	u8	count;
	u32	OldestTime;
	u32	Time;
	u8	Buffer[5];
	u32	Byte;
	u8	length;
	u8	flag;
	u8	SignNum;
	
	if(0 == SdOnOffFlag)
	{
		return ;
	}

	if(MEDIA_TYPE_JPG == Type)
	{
		strcpy((char *)Dir,"1:/JPG");
		Folder = CurrentJpgFolder;
		if(0 == Folder)
		{
			return ;
		}
	}
	else
	{
		strcpy((char *)Dir,"1:/WAV");
		Folder = CurrentWavFolder;
		if(0 == Folder)
		{
			return ;
		}
	}
	flag = 0;
	//判断是否进入循环存储
	for(i=0; i<2; i++)
	{
		Folder++;
		if(Folder > FOLDER_NUM_MAX)
		{
			Folder = 1;
		}
		if(Folder < 10)
		{
			Dir[6] = Folder+0x30;
			Dir[7] = 0;
		}
		else
		{
			Dir[6] = Folder/10+0x30;
			Dir[7] = Folder%10+0x30;
			Dir[8] = 0;
		}
        IWDG_ReloadCounter();//喂狗,dxl,2014.6.18
		if(FR_OK == f_opendir(&dir,ff_NameConver(Dir)))
		{
			strcpy((char *)FileName,(char const *)Dir);
			length = strlen((char const *)FileName);
			memcpy(FileName+length,"/log.bin",8);
			FileName[length+8] = 0;
			if(FR_OK == f_open(&file,ff_NameConver(FileName),FA_READ|FA_WRITE))
			{
				if(file.fsize >= 9)
				{
					f_close(&file);
					flag = 1;
					strcpy((char *)FileName,(char const *)Dir);
					length = strlen((char const *)FileName);
					strcpy((char *)FileName+length,"/delete.bin");
					if(FR_OK == f_open(&file,ff_NameConver(FileName),FA_OPEN_ALWAYS|FA_READ|FA_WRITE))
					{
				
					}
					f_close(&file);
					Media_EnableDeleteFlag();//不管是ACC ON还是ACC OFF都会删除文件
				}
			}
			f_close(&file);
		}
	}
	if(1 == flag)
	{
		return ;//优先标记需要删除的
	}
		
	//读剩余空间,小于500M时开始标记
	SignNum = Media_GetSignNum(Type);
	if(SignNum >= 3)//达到3被标记时强制删除
	{
		Media_EnableDeleteFlag();//不管是ACC ON还是ACC OFF都会删除文件
		return ;//最多只能标记两个
	}
	ReservedByte = GetRestKByte();
	if(0 == ReservedByte)//读剩余空间错误
	{
		return ;
	}
	if(ReservedByte <= MEDIA_START_SIGN_SIZE)//小于500M时会标记要删除的文件
	{
		OldestTime = 0xffffffff;
		count = 0;
		for(i=1; i<=FOLDER_NUM_MAX; i++)
		{
                IWDG_ReloadCounter();//喂狗
			if(i < 10)
			{
				Dir[6] = i+0x30;
				Dir[7] = 0;
			}
			else
			{
				Dir[6] = i/10+0x30;
				Dir[7] = i%10+0x30;
				Dir[8] = 0;
			}
			strcpy((char *)FileName,(char const *)Dir);
			length = strlen((char const *)FileName);
			memcpy(FileName+length,"/log.bin",8);
			FileName[length+8] = 0;
            IWDG_ReloadCounter();//喂狗,dxl,2014.6.18
			if(FR_OK == f_open(&file,ff_NameConver(FileName),FA_READ|FA_WRITE))
			{
				count++;
				if(file.fsize >= 9)
				{
					f_lseek(&file,file.fsize-9);
					if(FR_OK == f_read (&file, Buffer, 4, &Byte))
					{
						Time = 0;
						Time |= Buffer[0] << 24;
						Time |= Buffer[1] << 16;
						Time |= Buffer[2] << 8;
						Time |= Buffer[3];
						f_close(&file);
						if(Time < OldestTime)
						{
							strcpy((char *)FileName,(char const *)Dir);
							length = strlen((char const *)FileName);
							strcpy((char *)FileName+length,"/delete.bin");
							if(FR_OK == f_open(&file,ff_NameConver(FileName),FA_READ|FA_WRITE))
							{
							
							}
							else
							{
								OldestTime = Time;
								j = i;
							}
						}
					}
				}
			}
			f_close(&file);
		}
		if((OldestTime != 0xffffffff)&&((count-SignNum) > 3))//至少保留3个没有被标记的文件夹
		{
			if(j < 10)
			{
				Dir[6] = j+0x30;
				Dir[7] = 0;
			}
			else
			{
				Dir[6] = j/10+0x30;
				Dir[7] = j%10+0x30;
				Dir[8] = 0;
			}
			strcpy((char *)FileName,(char const *)Dir);
			length = strlen((char const *)FileName);
			strcpy((char *)FileName+length,"/delete.bin");
			if(FR_OK == f_open(&file,ff_NameConver(FileName),FA_OPEN_ALWAYS|FA_READ|FA_WRITE))
			{
				
