nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/Media.c
			}
			f_close(&file);
		}
		SignNum = Media_GetSignNum(Type);
		//标记图像和音频
		if((SignNum >= 3)||(ReservedByte <= MEDIA_UNLIMITED_SIGN_SIZE))//小于100M或达到3被标记时强制删除
		{
			Media_EnableDeleteFlag();//不管是ACC ON还是ACC OFF都会删除文件
			return ;//最多只能标记两个
		}
	}
	
	
	
	
}
/*********************************************************************
//函数名称	:Media_TimeTask
//功能		:该任务负责删除SD卡中标记了的文件夹
//输入		:
//输出		:
//使用资源	:
//全局变量	:   
//调用函数	:
//中断资源	:  
//返回		:
//备注		:在一个文件夹创建一个delete.bin文件，用于标识该文件夹需要删除,调用一次只能标记一个文件夹
*********************************************************************/
FunctionalState   Media_TimeTask(void)
{
	static u8	DelFolder = 0;
	static u8	DelType = 0;
	static u8	DelState = 0;
	static u16	Count = 0;
	static u8	DelDir[15];
	static u16	Count2 = 0;
	
	u8	i;
	u8	ACC;
	u8	FileName[_MAX_LFN];
	u8	flag;
	u8	length;
	u8	Dir[15];
	u8	SignNum;
	u32	ReservedByte;
	DIR	dir;
	FRESULT res;
	FILINFO FileInfo;
	FIL	file;
	u8      FileName_1[_MAX_LFN];
        
    if(0 == SdOnOffFlag)
	{
		return ENABLE;
	}
        /*//dxl,2015.8 
	ACC = Io_ReadStatusBit(STATUS_BIT_ACC);
	 if(0 == ACC)
	{
		SetTimerTask(TIME_MEDIA, SYSTICK_1SECOND);//1秒调度一次
		
	 }
	else
	{
		SetTimerTask(TIME_MEDIA, 5*SYSTICK_0p1SECOND);//0.5秒调度一次
	}
	*/
	Count2++;
	if(Count2 >= 7200)//ACC ON时,每小时检测一次剩余空间,ACC OFF时每2小时检测一次
	{
		Count2 = 0;
		ReservedByte = GetRestKByte();
		if(ReservedByte <= MEDIA_UNLIMITED_SIGN_SIZE)//小于500M时会标记要删除的文件
		{
			//读当前标记的数量
			SignNum = Media_GetSignNum(MEDIA_TYPE_JPG);
			if(0 == SignNum)
			{
				Media_SignDelFlag(MEDIA_TYPE_JPG);
			}
			//读当前标记的数量
			SignNum = Media_GetSignNum(MEDIA_TYPE_WAV);
			if(0 == SignNum)
			{
				Media_SignDelFlag(MEDIA_TYPE_WAV);
			}
			Media_EnableDeleteFlag();
		}
	}
	if((0 == ACC)||(1 == MediaDelEnableFlag))//ACC OFF
	{
		if(0 == DelState)//空闲
		{
			if(1 == EnableFlag)
			{
				DelState = 1;
				Count = 0;
			}
			else
			{
				Count++;
				if(Count > 1800)//空闲半小时监测1次，看是否有文件需要删除
				{
					EnableFlag = 1;
				}
			}
		}
		else if(1 == DelState)//确定具体的文件夹
		{
			DelType = DelType%2;
			if(0 == DelType)
			{
				strcpy((char *)Dir,"1:/WAV");//录音优先
			}
			else
			{
				strcpy((char *)Dir,"1:/JPG");
			}
			DelFolder = 0;
			for(i=1; i<=FOLDER_NUM_MAX; i++)
			{
				if(i < 10)
				{
					Dir[6] = i+0x30;
					Dir[7] = 0;
				}
				else
				{
					Dir[6] = i/10+0x30;
					Dir[7] = i%10+0x30;
					Dir[8] = 0;
				}
				strcpy((char *)FileName,(char const *)Dir);
				length = strlen((char const *)FileName);
				strcpy((char *)FileName+length,"/delete.bin");
                IWDG_ReloadCounter();//喂狗,dxl,2014.6.18
				if(FR_OK == f_open(&file,ff_NameConver(FileName),FA_READ|FA_WRITE))
				{
					DelFolder = i;
					strcpy((char *)DelDir,(char const*)Dir);
					f_close(&file);
					break;
				}
				f_close(&file);
				
			}
			DelType++;//下一次删除的类型要改变
			if(0 != DelFolder)//找到了文件夹
			{
				DelState = 2;
			}
			else
			{
				DelType = DelType%2;
				if(0 == DelType)
				{
					strcpy((char *)Dir,"1:/WAV");//录音优先
				}
				else
				{
					strcpy((char *)Dir,"1:/JPG");
				}
				DelFolder = 0;
				for(i=1; i<=FOLDER_NUM_MAX; i++)
				{
					if(i < 10)
					{
						Dir[6] = i+0x30;
						Dir[7] = 0;
					}
					else
					{
						Dir[6] = i/10+0x30;
						Dir[7] = i%10+0x30;
						Dir[8] = 0;
					}
					strcpy((char *)FileName,(char const *)Dir);
					length = strlen((char const *)FileName);
					strcpy((char *)FileName+length,"/delete.bin");
                    IWDG_ReloadCounter();//喂狗,dxl,2014.6.18
					if(FR_OK == f_open(&file,ff_NameConver(FileName),FA_READ|FA_WRITE))
					{
						DelFolder = i;
						strcpy((char *)DelDir,(char const*)Dir);
						f_close(&file);
						break;
					}
					f_close(&file);
				
				}
				DelType++;//下一次删除的类型要改变
				if(0 != DelFolder)//找到了文件夹
				{
					DelState = 2;
				}
				else
				{
					EnableFlag = 0;//关闭删除流程
					DelState = 0;
					MediaDelEnableFlag = 0;
				}
			}
			
		}
		else if(2 == DelState)//删除文件
		{
			flag = 0;
			if(f_opendir(&dir, ff_NameConver(DelDir)) == FR_OK)   //打开目录成功
            {
                for(;;)
				{
                    IWDG_ReloadCounter();//喂狗,dxl,2014.6.18
                    res = f_readdir(&dir,&FileInfo);
                    if(res != FR_OK || FileInfo.fname[0]==0)break;
                    if(FileInfo.fname[0]=='.')continue  ;
				    strcpy((char *)FileName,(char const*)DelDir);
                    ff_NameForward(FileName_1,FileInfo.fname);
			        if((0 == strncmp((char const *)FileName_1,"delete",6))||(0 == strncmp((char const *)FileName_1,"DELETE",6)))
			        {
			            //到最后删除delete.bin文件
			        }
			        else
			        {
	                    flag = 1;
				        length = strlen((char const *)FileName);
					    FileName[length] = '/';
					    length++;
					    FileName[length] = 0;
                        ff_NameForward(FileName_1,FileInfo.fname);
                        strcat((char *)FileName,(char const *)FileName_1);
                        res = f_unlink(ff_NameConver(FileName));       //删除文件
                        break; 
			        }
		        }
			}
			//是否只剩最后一个文件了?
			if(0 == flag)
			{
				//删除delete.bin文件
				strcpy((char *)FileName,(char const *)DelDir);
				length = strlen((char const *)FileName);
				strcpy((char *)FileName+length,"/delete.bin");
				res = f_unlink(ff_NameConver(FileName));  //删除文件
				//删除目录
				res = f_unlink(ff_NameConver(DelDir)); //删除文件
				DelState = 0;
			}
			
			
		}
		
	}
	else
	{
		DelState = 0;
		DelType = 0;
		Count = 0;
		EnableFlag = 1;
	}
	return ENABLE;
}
/*********************************************************************
//函数名称	:Media_UploadTimeTask(void)
//功能		:存储多媒体数据上传定时任务
//输入		:
//输出		:
//使用资源	:
//全局变量	:
//调用函数	:
//中断资源	:
//返回		:
//备注		:
*********************************************************************/
FunctionalState Media_UploadTimeTask(void)
{
	static  u16	MemoryUploadSendCountMax = 0;//发送次数计数最大值
	static  u8 	State = 0;//状态
	static  u8	count = 0;
	static  u8	MemoryUploadBuffer[600];
	static  u8	Buffer[37];
	static  FIL	file;
	u32	Byte;
	u16	length;
	u8	flag = 0;
	u8      Buffer2[5];
        u32     temp;
        u8 channel = 0;//dxl,2015.8 CHANNEL_DATA_1;//为编译通过而添加
        
