nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/Media.c
        if(0 == strlen((char const *)MemoryUploadFileName))
        {
                MultiMediaSendFlag = 0;
		State = 0;
		count = 0;
		MemoryUploadSendCount = 0;
		MemoryUploadSendCountMax = 0;
		memset(MemoryUploadFileName,0,33);
                RecordSendFlag = 0;
                return DISABLE;
        }
	if(0 == State)//打开文件
	{
		if(FR_OK == f_open(&file,ff_NameConver(MemoryUploadFileName),FA_READ))
		{
			count = 0;
			State++;
			MemoryUploadSendCount = 1;//发送次数计数
			MemoryUploadSendCountMax = (file.fsize-36)/512;
			if(0 != (file.fsize-36)%512)
			{
				MemoryUploadSendCountMax++;
			}
                        //dxl,2015.8 Subpackage_Media_File_Name_Set((char const *)MemoryUploadFileName);
                        
		}
		else
		{
			count++;
			if(count >= 3)
			{
				f_close(&file);
				flag = 1;
			}
		}
	}
        else if(1 == State)//获取属性信息
	{
		f_lseek(&file, file.fsize-36);
		if(FR_OK == f_read (&file, Buffer, 36, &Byte))
		{
			count = 0;
			State++;
			f_lseek(&file, 0);
		}
		else
		{
			count++;
			if(count >= 3)
			{
				f_close(&file);
				flag = 1;
			}
		}
	}
	else if(2 == State)//读取一包数据
	{
		if(FR_OK == f_read (&file, MemoryUploadBuffer, 512, &Byte))
		{
			count = 0;
			State++;
		}
		else
		{
			count++;
			if(count >= 3)
			{
				f_close(&file);
				flag = 1;
			}
		}
	}
	else if(3 == State)//发送
	{
		if(1 == MemoryUploadSendCount)//第1包
		{
			memmove(MemoryUploadBuffer+36,MemoryUploadBuffer,512);
			memcpy(MemoryUploadBuffer,Buffer,36);
			length = 36+512;
                        //设置心跳包时间间隔为10分钟
                        temp = 600;
	                Buffer2[0] = (temp & 0xff000000) >> 24;
	                Buffer2[1] = (temp & 0xff0000) >> 16;
	                Buffer2[2] = (temp & 0xff00) >> 8;
	                Buffer2[3] = temp;
	                EepromPram_WritePram(E2_TERMINAL_HEARTBEAT_ID, Buffer2, E2_TERMINAL_HEARTBEAT_LEN);
		}
		else
		{
			length = 512;
		}
		/*
		if(ACK_OK == RadioProtocol_MultiMediaDataReport(channel,MemoryUploadBuffer, length, MemoryUploadSendCountMax, MemoryUploadSendCount))
		{
			MemoryUploadSendCount++;
			if(MemoryUploadSendCount > MemoryUploadSendCountMax)
			{
				State++;
			}
			else
			{
				State--;
			}
			count = 0;
		}
		else
		{
			count++;
			if(count >= 30)//重传30次不成功，退出
			{
				flag = 1;
                                f_close(&file);
			}
		}
		*/
	}
	else
	{
		f_close(&file);
		flag = 1;
	}
	
	//以下为编译不报警告而添加
	if(0 == length)
	{
		length = 1;
	}
	if(1 == channel)
	{
			channel = 0;
	}
	//////////////////
	if(0 == SdOnOffFlag)
    {
        flag = 1;//SD卡不在或总线通信故障了直接关闭该任务,dxl,2014.6.18
    }
	if(0 == flag)
	{
		MultiMediaSendFlag = 1;
		//暂停任务,待上传完以后再开启
		//dxl,2015.8 ClrTimerTask(TIME_CAMERA);
		///ClrTimerTask(TIME_RECORD);
		//暂停心跳包
                //dxl,2015.8 ClrTimerTask(TIME_HEART_BEAT);
                //暂停位置汇报,行标检测时使用，实际出货时不使用
                //ClrTimerTask(TIME_POSITION);传输多媒体时定时任务是关闭的，为测试盲区不关闭定时上报
      		return ENABLE;
	}
	else
	{
		MultiMediaSendFlag = 0;
		State = 0;
		count = 0;
		MemoryUploadSendCount = 0;
		MemoryUploadSendCountMax = 0;
		memset(MemoryUploadFileName,0,33);
                RecordSendFlag = 0;
		//开启拍照
		//dxl,2015.8 SetTimerTask(TIME_CAMERA, 1);
                //SetTimerTask(TIME_CAMERA, 1);//dxl
		//SetTimerTask(TIME_RECORD,RECORD_TASK_TIME);//启动设置调度任务
                //开启心跳包
                //dxl,2015.8 SetTimerTask(TIME_HEART_BEAT, SYSTICK_1SECOND);
                //开启位置汇报,行标检测时使用，实际出货时不使用
                //SetTimerTask(TIME_POSITION, SYSTICK_1SECOND);
                //设置心跳包时间间隔为60秒
                //temp = 180;//行标检测时设置长些，以免影响其它检测功能
		        //temp = 60;
	        //Buffer2[0] = (temp & 0xff000000) >> 24;
	        //Buffer2[1] = (temp & 0xff0000) >> 16;
	        //Buffer2[2] = (temp & 0xff00) >> 8;
	        //Buffer2[3] = temp;
	        //EepromPram_WritePram(E2_TERMINAL_HEARTBEAT_ID, Buffer2, E2_TERMINAL_HEARTBEAT_LEN);
		return DISABLE;
	}
	
}
